let arrayPage = [
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 1,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 2,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 3,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 4,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 5,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 6,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 7,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 8,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 9,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
  {
    id: 10,
    title: "България W17 отстъпи на Украйна в равностоен двубой",
    description:
      "Националният тим на България за девойки до 17 г. загуби първия си двубой от втората фаза на европейските квалификации по футбол срещу Украйна с 1:2. Мачът се игра на ст. „Хаджи Димитър“ в Сливен. <br> <br> Нашите момичета и най-вече вратарката ни Милена Караколева заслужиха поздравления за представянето си в първите 60 минути срещу един от най-силните отбори на континента, след като успяха да парират постоянните опити на домакините да открият резултата.",
    date: "06 Март 2023 15:00",
    image: "./images/info/info-article.jpg",
    link: "#",
  },
];
const pagList = document.querySelector(".pagination");
const showList = document.querySelectorAll(".infoArticle__wrapper");
const itemsPerPage = 5; //Customizable
// let paginationDotStep = 1; //Customizable
// let currentPage = 1;
// window.addEventListener("resize", function () {
//   if (window.innerWidth < 540) {
//     console.log("540");
//   }
// });

// window.onresize = ()=>{

// }
// Create and append pagination buttons
// function createAndAppendPaginationButtons(pagination, pageCount) {
//   const previousButton = createPreviousButton();
//   const nextButton = createNextButton();

//   // previousButton.style.visibility = currentPage > 1 ? "visible" : "hidden"; // or "block" : "none"
//   // nextButton.style.visibility = currentPage < pageCount ? "visible" : "hidden"; // or "block" : "none"

//   pagination.appendChild(previousButton);

//   let startPage = Math.max(1, currentPage - 2);
//   let endPage = Math.min(pageCount, currentPage + 9);
//   console.log(startPage, " ", endPage, " ", pageCount);

//   if (startPage > 1) {
//     const prevDots = document.createElement("button");
//     prevDots.innerText = "...";
//     prevDots.addEventListener("click", () => {
//       currentPage = Math.max(1, currentPage - paginationDotStep);
//       smartList(currentPage);
//       updatePagination();
//     });
//     const button1 = createPageButton(1);
//     const button2 = createPageButton(2);
//     const button3 = createPageButton(3);
//     pagination.appendChild(button1);
//     pagination.appendChild(button2);
//     pagination.appendChild(button3);
//     pagination.appendChild(prevDots);
//   }
//   console.log(currentPage);
//   if (startPage > 1 && endPage < pageCount - 3) {
//     console.log(" if");

//     for (let i = currentPage; i <= endPage; i++) {
//       const button = createPageButton(i);
//       pagination.appendChild(button);
//     }
//   } else {
//     for (let i = startPage; i <= endPage + 3; i++) {
//       const button = createPageButton(i);
//       pagination.appendChild(button);
//     }
//   }

//   // else if () {
//   //   console.log("else if");
//   //   for (let i = currentPage; i <= endPage + 3; i++) {
//   //     const button = createPageButton(i);
//   //     pagination.appendChild(button);
//   //   }
//   // }

//   if (endPage < pageCount - 3) {
//     const nextDots = document.createElement("button");
//     nextDots.innerText = "...";
//     nextDots.addEventListener("click", () => {
//       currentPage = Math.min(pageCount, currentPage + paginationDotStep);
//       smartList(currentPage);
//       updatePagination();
//     });
//     pagination.appendChild(nextDots);
//     const button1 = createPageButton(pageCount - 2);
//     const button2 = createPageButton(pageCount - 1);
//     const button3 = createPageButton(pageCount);
//     pagination.appendChild(button1);
//     pagination.appendChild(button2);
//     pagination.appendChild(button3);
//   }
//   pagination.appendChild(nextButton);
// }
// selecting required element
const element = document.querySelector(".pagination ul");
let totalPages = Math.ceil(arrayPage.length / itemsPerPage);
// let totalPages = 40;
let page = 1;

//calling function with passing parameters and adding inside element which is ul tag
element.innerHTML = createPagination(totalPages, page);
function createPagination(totalPages, page) {
  smartList(page - 1);
  let liTag = "";
  let active;
  let beforePage = page - 1;
  let afterPage = page + 1;
  if (page > 1) {
    //show the next button if the page value is greater than 1
    liTag += `<li class="btn prev" onclick="createPagination(totalPages, ${
      page - 1
    })"><span><i class="fas fa-angle-left"></i></span></li>`;
  } else {
    liTag += `<li class="btn prev" ><span><i class="fas fa-angle-left"></i></span></li>`;
  }

  if (page > 2) {
    //if page value is less than 2 then add 1 after the previous button
    liTag += `<li class="first numb" onclick="createPagination(totalPages, 1)"><span>1</span></li>`;
    if (page > 3) {
      //if page value is greater than 3 then add this (...) after the first li or page
      liTag += `<li class="dots"><span>...</span></li>`;
    }
  }

  // how many pages or li show before the current li
  if (page == totalPages) {
    beforePage = beforePage - 1;
  } else if (page == totalPages - 1) {
    beforePage = beforePage - 1;
  }
  // how many pages or li show after the current li
  if (page == 1) {
    afterPage = afterPage + 1;
  } else if (page == 2) {
    afterPage = afterPage + 1;
  }

  for (var plength = beforePage; plength <= afterPage; plength++) {
    if (plength > totalPages) {
      //if plength is greater than totalPage length then continue
      continue;
    }
    if (plength == 0) {
      //if plength is 0 than add +1 in plength value
      plength = plength + 1;
    }
    if (page == plength) {
      //if page is equal to plength than assign active string in the active variable
      active = "active";
    } else {
      //else leave empty to the active variable
      active = "";
    }
    liTag += `<li class="numb ${active}" onclick="createPagination(totalPages, ${plength})"><span>${plength}</span></li>`;
  }

  if (page < totalPages - 1) {
    //if page value is less than totalPage value by -1 then show the last li or page
    if (page < totalPages - 2) {
      //if page value is less than totalPage value by -2 then add this (...) before the last li or page
      liTag += `<li class="dots"><span>...</span></li>`;
    }
    liTag += `<li class="last numb" onclick="createPagination(totalPages, ${totalPages})"><span>${totalPages}</span></li>`;
  }

  if (page < totalPages) {
    //show the next button if the page value is less than totalPage(20)
    liTag += `<li class="btn next" onclick="createPagination(totalPages, ${
      page + 1
    })"><span> <i class="fas fa-angle-right"></i></span></li>`;
  } else {
    liTag += `<li class="btn next"<span> <i class="fas fa-angle-right"></i></span></li>`;
  }
  element.innerHTML = liTag; //add li tag inside ul tag
  return liTag; //reurn the li tag
}
// Create the previous button
// function createPreviousButton() {
//   const previousButton = document.createElement("button");
//   previousButton.classList.add("prev");
//   // previousButton.innerText = "Prev";
//   previousButton.addEventListener("click", () => {
//     currentPage--;
//     smartList(currentPage);
//     updatePagination();
//   });
//   return previousButton;
// }
// // Create the next button
// function createNextButton() {
//   const nextButton = document.createElement("button");
//   nextButton.classList.add("next");
//   // nextButton.innerText = "Next";
//   nextButton.addEventListener("click", () => {
//     currentPage++;
//     smartList(currentPage);
//     updatePagination();
//   });
//   return nextButton;
// }

// // Create a page button
// function createPageButton(i) {
//   const button = document.createElement("button");
//   button.innerText = i;
//   button.addEventListener("click", () => {
//     currentPage = i;
//     smartList(currentPage);
//     updatePagination();
//   });
//   if (i === currentPage) {
//     button.classList.add("active");
//   }
//   return button;
// }
// // paginationBtn(arrayPage);

// function updatePagination() {
//   const pageCount = Math.ceil(arrayPage.length / itemsPerPage);
//   pagList.innerHTML = "";
//   if (pageCount <= 1) {
//     return;
//   }
//   createAndAppendPaginationButtons(pagList, pageCount);
// }
// updatePagination();
// const btnPag = document.querySelectorAll(".pagination__btn");

function smartList(page, size = 5) {
  let arrayList = [];
  arrayList = arrayPage.slice().splice(page * size, size);
  showList.forEach((elem, i) => {
    let item = "";
    for (let i = 0; i < arrayList.length; i++) {
      item += `        <div class="infoArticle big">
            <div class="infoArticle__image">
                <img src="${arrayList[i].image}" alt="" />
            </div>
            <div class="infoArticle__content">
                <div class="infoArticle__content-text">
                    <h3>${arrayList[i].title}</h3>
                    <p>
                    ${arrayList[i].description}

                    </p>
                </div>
                <div class="infoArticle__content-bottom">
                    <p>${arrayList[i].date}</p>
                    <a href="${arrayList[i].link}">
                        <img src="./images/icons/share.svg" alt="" />
                    </a>
                </div>
            </div>
        </div>`;
    }
    elem.innerHTML = item;
  });
  //   btnPag[0].classList.add("pagination__btn-active");
}

// function addClass(btnElem, prevBtn) {
//   prevBtn.forEach((elem) => elem.classList.remove("pagination__btn-active"));
//   btnElem.classList.add("pagination__btn-active");
// }

// btnPag.forEach((elem, i) => {
//   elem.addEventListener("click", () => {
//     smartList(i);
//     addClass(elem, btnPag);
//   });
// });

smartList(0);
